InformationRegisters/ОстаткиВзаиморасчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>ОстаткиВзаиморасчетов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>ВидыКонтрагентов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮридическоеЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИндивидуальныйПредприниматель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФизическоеЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГосударственныйОрган</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыОперацийРасходнаяНакладная.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>ВидыОперацийРасходнаяНакладная</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПродажаПокупателю</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаНаКомиссию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаВПереработку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаНаОтветХранение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратПоставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратКомитенту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратИзПереработки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратСОтветХранения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыкупТоваровКомиссионером</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыДоговоров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>ВидыДоговоров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СПоставщиком</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СПокупателем</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомитентом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомиссионером</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыОперацийПриходнаяНакладная.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>ВидыОперацийПриходнаяНакладная</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеОтПоставщика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриемНаКомиссию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриемВПереработку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриемНаОтветХранение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОтПокупателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОтКомиссионера</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОтПереработчика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратСОтветХранения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыкупленныеКомиссионеромТовары</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыОперацийЗаказПокупателя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>ВидыОперацийЗаказПокупателя</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗаказНаПродажу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаказНаПереработку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаказНаряд</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыОперацийЗаказПоставщику.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>ВидыОперацийЗаказПоставщику</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗаказНаЗакупку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаказНаПереработку</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыОперацийПоступлениеНаСчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>ВидыОперацийПоступлениеНаСчет</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОтПокупателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтПоставщика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтПодотчетника</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПокупкаВалюты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеРасчеты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Налоги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыПоКредитам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратЗаймаСотрудником</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеОплатыПоКартам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзносНаличными</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереводСДругогоСчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтКурьерскойКомпанииПочты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛичныеСредстваПредпринимателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеОплатыПоКредитам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтНашейОрганизации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеОтПродажиВалюты</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыОперацийРасходСоСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>ВидыОперацийРасходСоСчета</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Поставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Покупателю</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подотчетнику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Зарплата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Налоги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеРасчеты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыПоКредитам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаЗаймаСотруднику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОплатыНаПлатежныеКарты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаРасходы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СнятиеНаличных</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереводНаДругойСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗарплатаСотруднику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛичныеСредстваПредпринимателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратПродажиВКредит</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КомиссияБанка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НашейОрганизации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплатыСамозанятым</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплатаСамозанятому</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыОперацийПоступлениеВКассу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>ВидыОперацийПоступлениеВКассу</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОтПокупателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтПоставщика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтПодотчетника</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РозничнаяВыручка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РозничнаяВыручкаСуммовойУчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПокупкаВалюты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеРасчеты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыПоКредитам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратЗаймаСотрудником</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолучениеНаличныхВБанке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛичныеСредстваПредпринимателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтНашейОрганизации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеОтПродажиВалюты</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/РаботаСКонтрагентамиУНФ/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Важно: заполнение реализации метода обязательно.
// Определяет свойства справочников контрагентов.
// Параметры:
//	СвойстваСправочников - ТаблицаЗначений - в таблице заполняется список
//		справочников контрагентов и их свойства. Колонки таблицы:
//		* Имя - Строка - имя справочника;
//		* Иерархический - Булево - справочник является иерархическим;
//		* РеквизитИНН - Строка- имя реквизита ИНН;
//		* РеквизитКПП - Строка- имя реквизита КПП;
//		* ОтключитьСозданиеИзДосьеКонтрагента - Булево - если Истина,
//			тогда не будет предлагаться создание элемента справочника из
//			отчета "Досье контрагента".
//
//@skip-warning
Процедура ПриОпределенииСвойствСправочниковКонтрагентов(СвойстваСправочников) Экспорт
	
	НоваяСтрока = СвойстваСправочников.Добавить();
	НоваяСтрока.Имя = "Контрагенты";
	НоваяСтрока.Иерархический = Истина;
	НоваяСтрока.РеквизитИНН = "ИНН";
	НоваяСтрока.РеквизитКПП = "КПП";
	
КонецПроцедуры

// Определяет, является ли контрагент физическим или юридическим лицом.
//
// Параметры:
//  СтандартнаяОбработка  - Булево - если стандартный механизм переопределяется, то должно быть установлено значение "Ложь".
//  ЭтоЮрЛицо             - Булево - Истина, если юридическое лицо, и Ложь, если физическое.
//  ДанныеКонтрагента     - Структура - структура, которая содержит данные обрабатываемого контрагента.
//
//@skip-warning
Процедура ПриОпределенииВидаКонтрагента(СтандартнаяОбработка, ЭтоЮрЛицо, ДанныеКонтрагента) Экспорт
	
	Если ДанныеКонтрагента.ДополнительныеПараметры.Свойство("ЭтоЮридическоеЛицо") Тогда
		ЭтоЮрЛицо = ДанныеКонтрагента.ДополнительныеПараметры.ЭтоЮридическоеЛицо;
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

// Определяется, является ли контрагент иностранным.
//
// Параметры:
//  ДанныеКонтрагента   - СтрокаТаблицыЗначений - Содержит информацию о контрагенте. 
//      Подробнее о колонках таблицы можно узнать в описании к процедуре ПроверкаКонтрагентов.ШаблонТаблицыДанныеКонтрагента().
//  ЯвляетсяИностранным - Булево - Результат проверки.
//
//@skip-warning
Процедура ПриОпределенииКонтрагентЯвляетсяИностранным(ДанныеКонтрагента, ЯвляетсяИностранным) Экспорт
	
	ЯвляетсяИностранным = КонтрагентЯвляетсяИностранным(ДанныеКонтрагента.Контрагент);
	
КонецПроцедуры

// Возможность дополнить структуру РеквизитыПроверкиКонтрагентов для формы справочника. 
//
// Параметры:
//  Форма  - ФормаКлиентскогоПриложения - форма, для которой дополняется структура РеквизитыПроверкиКонтрагентов.
//  НовыеРеквизиты  - Структура - структура, которая транслируется в реквизит формы РеквизитыПроверкиКонтрагентов.
//
//@skip-warning
Процедура ДополнитьРеквизитыФормыКонтрагент(Форма, НовыеРеквизиты) Экспорт
	
	Если Форма.ИмяФормы = "Справочник.Контрагенты.Форма.ФормаЭлемента" Тогда
		
		ВидЮрЛицо 	= ПредопределенноеЗначение("Перечисление.ВидыКонтрагентов.ЮридическоеЛицо");
		ВидГосОрган = ПредопределенноеЗначение("Перечисление.ВидыКонтрагентов.ГосударственныйОрган");
		
		НовыеРеквизиты.ЭтоИностранныйКонтрагент = Форма.Объект.ВидКонтрагента = ВидЮрЛицо
														И Форма.Объект.СтранаРегистрации <> ПредопределенноеЗначение("Справочник.СтраныМира.Россия");
		НовыеРеквизиты.ЭтоЮридическоеЛицо 		= Форма.Объект.ВидКонтрагента = ВидЮрЛицо
														Или Форма.Объект.ВидКонтрагента = ВидГосОрган;
		
		НовыеРеквизиты.ОтключитьПроверкуФНС     = НовыеРеквизиты.ЭтоИностранныйКонтрагент;
		
		Если НовыеРеквизиты.ЭтоИностранныйКонтрагент Тогда 
			НовыеРеквизиты.ПричинаОтключенияПроверкиФНС =
				НСтр("ru = 'проверке подлежат только российские контрагенты'");
		КонецЕсли;
			
	КонецЕсли;
	
КонецПроцедуры

// Определяется, необходимо ли отключить проверку состояния контрагента в базе ФНС.
//
// Параметры:
//  ДанныеКонтрагента - СтрокаТаблицыЗначений - см. ПроверкаКонтрагентов.ШаблонТаблицыДанныеКонтрагента
//  ОтключитьПроверкуФНС - Булево, Неопределено - результат проверки состояния контрагента. Если установить Истина, то
//    проверка состояния контрагента в базе ФНС выполняться не будет.
//  ПричинаОтключения - Строка - краткое описание причины отключения проверки контрагента. Установленный текст будет
//    отображаться в окне подсказки поля контрагента, если параметр ОтключитьПроверкуФНС будет установлен в значение
//    Истина.
//
//@skip-warning
Процедура ПриОпределенииСтатусаПроверкиКонтрагентаВБазеФНС(
	ДанныеКонтрагента,
	ОтключитьПроверкуФНС,
	ПричинаОтключения) Экспорт

	ЯвляетсяИностранным = КонтрагентЯвляетсяИностранным(ДанныеКонтрагента.Контрагент);

	Если ЯвляетсяИностранным Тогда	
		ОтключитьПроверкуФНС = Истина;
		ПричинаОтключения 	 = ПричинаОтключенияПроверкиФНСИностраннаяОрганизация();
	КонецЕсли;
	
КонецПроцедуры

// Возвращает представление расчетов по контрагенту в формате "Должен нам/Мы должны"
//
// Параметры:
//  Контрагент - СправочникСсылка.Контрагент
//  СуммаДолга - Число
// 
// Возвращаемое значение:
//  Строка
//
Функция ЗаголовокНадписиВзаиморасчетов(Контрагент, СуммаДолга = 0) Экспорт
	
	КрупныйШрифт = Новый Шрифт(,11,,,);
	МелкийШрифт  = Новый Шрифт(,8, ,,);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОстаткиВзаиморасчетов.Сумма КАК Сумма
	|ИЗ
	|	РегистрСведений.ОстаткиВзаиморасчетов КАК ОстаткиВзаиморасчетов
	|ГДЕ
	|	ОстаткиВзаиморасчетов.Контрагент = &Контрагент";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Сумма = Выборка.Сумма;
	Иначе
		Сумма = 0;
	КонецЕсли;
	
	СуммаДолга = Сумма;
	ПредставлениеВалюты = СимвольноеПредставлениеВалютыУчета();
	
	КомпонентыФС = Новый Массив;
	Если Сумма < 0 Тогда
		КомпонентыФС.Добавить(Новый ФорматированнаяСтрока(НСтр("ru='Мы должны'") + " ", КрупныйШрифт));
		Сумма = -Сумма;
	Иначе
		КомпонентыФС.Добавить(Новый ФорматированнаяСтрока(НСтр("ru='Должен нам'") + " ", КрупныйШрифт));
	КонецЕсли;
	
	СуммаСтрокой = Формат(Сумма, "ЧДЦ=2; ЧРД=,; ЧРГ=' '; ЧН=0,00");
	ПозицияРазделителя = СтрНайти(СуммаСтрокой, ",");
	КомпонентыЧисла = Новый Массив;
	КомпонентыЧисла.Добавить(Новый ФорматированнаяСтрока(Лев(СуммаСтрокой, ПозицияРазделителя), КрупныйШрифт));
	КомпонентыЧисла.Добавить(Новый ФорматированнаяСтрока(Сред(СуммаСтрокой, ПозицияРазделителя+1), МелкийШрифт));
	КомпонентыФС.Добавить(Новый ФорматированнаяСтрока(КомпонентыЧисла, , , , "Взаиморасчеты"));
	
	КомпонентыФС.Добавить(" " + ПредставлениеВалюты);
	
	Возврат Новый ФорматированнаяСтрока(КомпонентыФС, , ЦветаСтиля.ТекстВторостепеннойНадписи);
	
КонецФункции

// Устарела. См. Справочники.ДоговорыКонтрагентов.ПоДокументуКонтрагентуОрганизацииИВидуОперации
//
Функция ПолучитьДоговорПоУмолчанию(Документ, Контрагент, Организация) Экспорт
	
	Результат = Справочники.ДоговорыКонтрагентов.ПоДокументуКонтрагентуОрганизацииИВидуОперации(Документ, Контрагент,
		Организация);
	Возврат Результат;
	
КонецФункции

// Возвращает вид договора контрагента соответствующий виду операции документа
//
// Параметры:
//  ВидОперации - ПеречислениеСсылка.ВидыОперацийДокументов - вид операции документа из которого создается контрагент
// 
// Возвращаемое значение:
//  ВидДоговора - ПеречислениеСсылка.ВидыДоговоров - вид договора соответствующий виду операции
//
Функция ПолучитьВидДоговораПоВидуОперации(ВидОперации) Экспорт
	
	// Расходная накладная
	Если ВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная.ВозвратПоставщику Тогда
		Возврат Перечисления.ВидыДоговоров.СПоставщиком;
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю Тогда
		Возврат Перечисления.ВидыДоговоров.СПокупателем;
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная.ВозвратИзПереработки Тогда
		Возврат Перечисления.ВидыДоговоров.СПокупателем;
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная.ВозвратКомитенту Тогда
		Возврат Перечисления.ВидыДоговоров.СКомитентом;
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная.ВозвратСОтветХранения Тогда
		Возврат Перечисления.ВидыДоговоров.СПокупателем;
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная.ВыкупТоваровКомиссионером Тогда
		Возврат Перечисления.ВидыДоговоров.СПокупателем;
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная.ПередачаВПереработку Тогда
		Возврат Перечисления.ВидыДоговоров.СПоставщиком;
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная.ПередачаНаКомиссию Тогда
		Возврат Перечисления.ВидыДоговоров.СКомиссионером;
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная.ПередачаНаОтветХранение Тогда
		Возврат Перечисления.ВидыДоговоров.СПоставщиком;
		
	// Приходная накладная
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПриходнаяНакладная.ПоступлениеОтПоставщика Тогда
		Возврат Перечисления.ВидыДоговоров.СПоставщиком;
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПриходнаяНакладная.ПриемНаКомиссию Тогда
		Возврат Перечисления.ВидыДоговоров.СКомитентом;
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПриходнаяНакладная.ПриемВПереработку Тогда
		Возврат Перечисления.ВидыДоговоров.СПокупателем;
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПриходнаяНакладная.ПриемНаОтветХранение Тогда
		Возврат Перечисления.ВидыДоговоров.СПокупателем;
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПриходнаяНакладная.ВозвратОтПокупателя Тогда
		Возврат Перечисления.ВидыДоговоров.СПокупателем;
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПриходнаяНакладная.ВозвратОтКомиссионера Тогда
		Возврат Перечисления.ВидыДоговоров.СКомиссионером;
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПриходнаяНакладная.ВозвратОтПереработчика Тогда
		Возврат Перечисления.ВидыДоговоров.СПоставщиком;
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПриходнаяНакладная.ВозвратСОтветХранения Тогда
		Возврат Перечисления.ВидыДоговоров.СПоставщиком;
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПриходнаяНакладная.ВыкупленныеКомиссионеромТовары Тогда
		Возврат Перечисления.ВидыДоговоров.СПокупателем;
		
	// Заказ покупателя
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийЗаказПокупателя.ЗаказНаПереработку Тогда
		Возврат Перечисления.ВидыДоговоров.СПокупателем;
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийЗаказПокупателя.ЗаказНаПродажу Тогда
		Возврат Перечисления.ВидыДоговоров.СПокупателем;
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийЗаказПокупателя.ЗаказНаряд Тогда
		Возврат Перечисления.ВидыДоговоров.СПокупателем;
		
	// Заказ-наряд
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийЗаказПокупателя.ЗаказНаряд Тогда
		Возврат Перечисления.ВидыДоговоров.СПокупателем;
		
	// Заказ поставщику
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийЗаказПоставщику.ЗаказНаЗакупку Тогда
		Возврат Перечисления.ВидыДоговоров.СПоставщиком;
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийЗаказПоставщику.ЗаказНаПереработку Тогда
		Возврат Перечисления.ВидыДоговоров.СПоставщиком;
		
	// Авансовый отчет
	ИначеЕсли ВидОперации = "АвансовыйОтчет" Тогда
		Возврат Перечисления.ВидыДоговоров.СПокупателем;
		
	// Прочие расходы
	ИначеЕсли ВидОперации = "ПрочиеРасходы" Тогда
		Возврат Перечисления.ВидыДоговоров.Прочее;
		
	// Акт выполненных работ
	ИначеЕсли ВидОперации = "АктВыполненныхРабот" Тогда
		Возврат Перечисления.ВидыДоговоров.СПокупателем;
	
	// Отчет комиссионера
	ИначеЕсли ВидОперации = "ОтчетКомиссионера" Тогда
		Возврат Перечисления.ВидыДоговоров.СКомиссионером;
		
	// Отчет комитенту
	ИначеЕсли ВидОперации = "ОтчетКомитенту" Тогда
		Возврат Перечисления.ВидыДоговоров.СКомитентом;
		
	// Причем и передача в ремонт
	ИначеЕсли ВидОперации = "ПриемИПередачаВРемонт" Тогда
		Возврат Перечисления.ВидыДоговоров.СПокупателем;
		
	// Счет на оплату
	ИначеЕсли ВидОперации = "СчетНаОплату" Тогда
		Возврат Перечисления.ВидыДоговоров.СПокупателем;
		
	// Счет на оплату поставщика
	ИначеЕсли ВидОперации = "СчетНаОплатуПоставщика" Тогда
		Возврат Перечисления.ВидыДоговоров.СПоставщиком;
		
	// Расходы при импорте
	ИначеЕсли ВидОперации = "РасходыПриИмпорте" Тогда
		Возврат Перечисления.ВидыДоговоров.Прочее;
		
	// Расход ДС план
	ИначеЕсли ВидОперации = "РасходДСПлан" Тогда
		Возврат Перечисления.ВидыДоговоров.СПоставщиком;
		
	// Передача ВА
	ИначеЕсли ВидОперации = "ПередачаВА" Тогда
		Возврат Перечисления.ВидыДоговоров.СПокупателем;
		
	// Операция по платежным картам
	ИначеЕсли ВидОперации = "ОперацияПоПлатежнымКартам" Тогда
		Возврат Перечисления.ВидыДоговоров.СПокупателем;
		
	// Доверенность
	ИначеЕсли ВидОперации = "Доверенность" Тогда
		Возврат Перечисления.ВидыДоговоров.СПоставщиком;
		
	// Договор кредита (займа)
	ИначеЕсли ВидОперации = "ДоговорКредитаИЗайма" Тогда
		Возврат Перечисления.ВидыДоговоров.Прочее;
		
	// Выплаты самозанятым
	ИначеЕсли ВидОперации = "ВыплатыСамозанятым" Тогда
		Возврат Перечисления.ВидыДоговоров.СПокупателем;
		
	// Ввод начальных остатков
	ИначеЕсли ВидОперации = "ВводОстатковКомитент" Тогда
		Возврат Перечисления.ВидыДоговоров.СКомитентом;
	ИначеЕсли ВидОперации = "ВводОстатковКомиссионер" Тогда
		Возврат Перечисления.ВидыДоговоров.СКомиссионером;
	ИначеЕсли ВидОперации = "ВводОстатковПоставщик" Тогда
		Возврат Перечисления.ВидыДоговоров.СПоставщиком;
	ИначеЕсли ВидОперации = "ВводОстатковПокупатель" Тогда
		Возврат Перечисления.ВидыДоговоров.СПокупателем;
	ИначеЕсли ВидОперации = "ВводОстатковПрочее" Тогда
		Возврат Перечисления.ВидыДоговоров.Прочее;
		
	// Поступление на счет
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.ОтПокупателя Тогда
		Возврат Перечисления.ВидыДоговоров.СПокупателем;
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.ОтПоставщика Тогда
		Возврат Перечисления.ВидыДоговоров.СПоставщиком;
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.РасчетыПоКредитам Тогда
		Возврат Перечисления.ВидыДоговоров.Прочее;
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.ПрочиеРасчеты Тогда
		Возврат Перечисления.ВидыДоговоров.Прочее;
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.ОтКурьерскойКомпанииПочты Тогда
		Возврат Перечисления.ВидыДоговоров.СПокупателем;
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.ПоступлениеОплатыПоКартам Тогда
		Возврат Перечисления.ВидыДоговоров.Прочее;
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.ПоступлениеОплатыПоКредитам Тогда
		Возврат Перечисления.ВидыДоговоров.Прочее;
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.ОтНашейОрганизации Тогда
		Возврат Перечисления.ВидыДоговоров.СПокупателем;
		
	// Расход со счета
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.Поставщику Тогда
		Возврат Перечисления.ВидыДоговоров.СПоставщиком;
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.ПрочиеРасчеты Тогда
		Возврат Перечисления.ВидыДоговоров.Прочее;
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.Покупателю Тогда
		Возврат Перечисления.ВидыДоговоров.СПокупателем;
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.РасчетыПоКредитам Тогда
		Возврат Перечисления.ВидыДоговоров.Прочее;
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.ВозвратОплатыНаПлатежныеКарты Тогда
		Возврат Перечисления.ВидыДоговоров.Прочее;
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.ВозвратПродажиВКредит Тогда
		Возврат Перечисления.ВидыДоговоров.СПокупателем;
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.Налоги Тогда
		Возврат Перечисления.ВидыДоговоров.Прочее;
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.КомиссияБанка Тогда
		Возврат Перечисления.ВидыДоговоров.Прочее
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.НашейОрганизации Тогда
		Возврат Перечисления.ВидыДоговоров.СПокупателем;
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.ВыплатыСамозанятым Тогда
		Возврат Перечисления.ВидыДоговоров.Прочее
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.ВыплатаСамозанятому Тогда
		Возврат Перечисления.ВидыДоговоров.Прочее
		
	// Поступление в кассу
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПоступлениеВКассу.ОтПокупателя Тогда
		Возврат Перечисления.ВидыДоговоров.СПокупателем;
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПоступлениеВКассу.ОтПоставщика Тогда
		Возврат Перечисления.ВидыДоговоров.СПоставщиком;
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПоступлениеВКассу.РасчетыПоКредитам Тогда
		Возврат Перечисления.ВидыДоговоров.Прочее;
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПоступлениеВКассу.ПрочиеРасчеты Тогда
		Возврат Перечисления.ВидыДоговоров.Прочее;
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПоступлениеВКассу.ОтНашейОрганизации Тогда
		Возврат Перечисления.ВидыДоговоров.СПокупателем;
		
	// Расход из кассы
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийРасходИзКассы.Поставщику Тогда
		Возврат Перечисления.ВидыДоговоров.СПоставщиком;
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийРасходИзКассы.ПрочиеРасчеты Тогда
		Возврат Перечисления.ВидыДоговоров.Прочее;
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийРасходИзКассы.Покупателю Тогда
		Возврат Перечисления.ВидыДоговоров.СПокупателем;
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийРасходИзКассы.РасчетыПоКредитам Тогда
		Возврат Перечисления.ВидыДоговоров.Прочее;
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийРасходИзКассы.Налоги Тогда
		Возврат Перечисления.ВидыДоговоров.Прочее;
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийРасходИзКассы.НашейОрганизации Тогда
		Возврат Перечисления.ВидыДоговоров.СПокупателем;
		
	// Платежное поручение
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПлатежноеПоручение.Оплата Тогда
		Возврат Перечисления.ВидыДоговоров.СПоставщиком;
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПлатежноеПоручение.НаРасходы Тогда
		Возврат Перечисления.ВидыДоговоров.Прочее;
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПлатежноеПоручение.Зарплата Тогда
		Возврат Перечисления.ВидыДоговоров.СПокупателем;
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПлатежноеПоручение.ПрочиеРасчеты Тогда
		Возврат Перечисления.ВидыДоговоров.Прочее;
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПлатежноеПоручение.Покупателю Тогда
		Возврат Перечисления.ВидыДоговоров.СПокупателем;
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПлатежноеПоручение.Прочее Тогда
		Возврат Перечисления.ВидыДоговоров.Прочее;
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПлатежноеПоручение.ПеречислениеНалога Тогда
		Возврат Перечисления.ВидыДоговоров.Прочее;
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПлатежноеПоручение.РасчетыПоКредитам Тогда
		Возврат Перечисления.ВидыДоговоров.Прочее;
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПлатежноеПоручение.ВыплатыСамозанятым Тогда
		Возврат Перечисления.ВидыДоговоров.Прочее
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПлатежноеПоручение.ВыплатаСамозанятому Тогда
		Возврат Перечисления.ВидыДоговоров.Прочее
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции


#Область ПрочиеПроцедуры

// Заполнение значений колонок ЭтоЮридическоеЛицо, ЭтоИностранныйКонтрагент, ОтключитьПроверкуФНС и
// ПричинаОтключенияПроверкиФНС в таблице с данными контрагента.
//
// Параметры:
//   ДанныеКонтрагентов - ТаблицаЗначений - таблица с данными контрагентов
//     см. ПроверкаКонтрагентов.ШаблонТаблицыДанныеКонтрагента.
//   СтандартнаяОбработка - Булево - если Истина, то заполнение будет выполнено стандартным образом путем перебора
//     каждой строки таблицы.
//
Процедура ДополнитьДанныеКонтрагентов(ДанныеКонтрагентов, СтандартнаяОбработка) Экспорт

	#Область ТекстЗапроса
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеКонтрагентов.Контрагент КАК Контрагент,
	|	ДанныеКонтрагентов.ИНН КАК ИНН,
	|	ДанныеКонтрагентов.КПП КАК КПП,
	|	ДанныеКонтрагентов.ЭтоЮридическоеЛицо КАК ЭтоЮридическоеЛицо,
	|	ДанныеКонтрагентов.ЭтоИностранныйКонтрагент КАК ЭтоИностранныйКонтрагент,
	|	ДанныеКонтрагентов.Дата КАК Дата,
	|	ДанныеКонтрагентов.ОбластьДанныхВспомогательныеДанные КАК ОбластьДанныхВспомогательныеДанные,
	|	ДанныеКонтрагентов.Состояние КАК Состояние,
	|	ДанныеКонтрагентов.ОтключитьПроверкуФНС КАК ОтключитьПроверкуФНС,
	|	ДанныеКонтрагентов.ПричинаОтключенияПроверкиФНС КАК ПричинаОтключенияПроверкиФНС
	|ПОМЕСТИТЬ ДанныеКонтрагентов
	|ИЗ
	|	&ДанныеКонтрагентов КАК ДанныеКонтрагентов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ДанныеКонтрагентов.Контрагент КАК Контрагент,
	|	ДанныеКонтрагентов.ИНН КАК ИНН,
	|	ДанныеКонтрагентов.КПП КАК КПП,
	|	ВЫБОР
	|		КОГДА Контрагенты.ВидКонтрагента ЕСТЬ NULL
	|			ТОГДА ДанныеКонтрагентов.ЭтоЮридическоеЛицо
	|		КОГДА Контрагенты.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ВидыКонтрагентов.ЮридическоеЛицо)
	|				ИЛИ Контрагенты.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ВидыКонтрагентов.ГосударственныйОрган)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоЮридическоеЛицо,
	|	ВЫБОР
	|		КОГДА ДанныеКонтрагентов.ЭтоИностранныйКонтрагент <> НЕОПРЕДЕЛЕНО
	|			ТОГДА ДанныеКонтрагентов.ЭтоИностранныйКонтрагент
	|		КОГДА Контрагенты.СтранаРегистрации ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		КОГДА Контрагенты.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЭтоИностранныйКонтрагент,
	|	ДанныеКонтрагентов.Дата КАК Дата,
	|	ДанныеКонтрагентов.ОбластьДанныхВспомогательныеДанные КАК ОбластьДанныхВспомогательныеДанные,
	|	ДанныеКонтрагентов.Состояние КАК Состояние,
	|	ВЫБОР
	|		КОГДА ДанныеКонтрагентов.ОтключитьПроверкуФНС = ИСТИНА
	|			ТОГДА ИСТИНА
	|		КОГДА ДанныеКонтрагентов.ЭтоИностранныйКонтрагент <> НЕОПРЕДЕЛЕНО
	|			ТОГДА ДанныеКонтрагентов.ЭтоИностранныйКонтрагент
	|		КОГДА Контрагенты.СтранаРегистрации ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		КОГДА Контрагенты.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ОтключитьПроверкуФНС,
	|	ВЫБОР
	|		КОГДА ДанныеКонтрагентов.ЭтоИностранныйКонтрагент <> НЕОПРЕДЕЛЕНО
	|			ТОГДА ДанныеКонтрагентов.ПричинаОтключенияПроверкиФНС
	|		КОГДА Контрагенты.СтранаРегистрации ЕСТЬ NULL
	|			ТОГДА """"
	|		КОГДА Контрагенты.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
	|			ТОГДА """"
	|		ИНАЧЕ &ПричинаОтключенияПроверкиИО
	|	КОНЕЦ КАК ПричинаОтключенияПроверкиФНС
	|ИЗ
	|	ДанныеКонтрагентов КАК ДанныеКонтрагентов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО ДанныеКонтрагентов.Контрагент = Контрагенты.Ссылка";
	
	Если НЕ ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.РаботаВМоделиСервиса") Тогда
			
		ТекстЗапроса = СтрЗаменить(
			ТекстЗапроса,
			"ДанныеКонтрагентов.ОбластьДанныхВспомогательныеДанные,",
			"");
				
	КонецЕсли;
	#КонецОбласти
	
	Если ОбщегоНазначения.РазделениеВключено()
		И ОбщегоНазначения.ДоступноИспользованиеРазделенныхДанных()
		ИЛИ НЕ ОбщегоНазначения.РазделениеВключено() Тогда
		
		СтандартнаяОбработка = Ложь;
		Запрос 				 = Новый Запрос(ТекстЗапроса);
		
		Запрос.УстановитьПараметр("ПричинаОтключенияПроверкиИО", ПричинаОтключенияПроверкиФНСИностраннаяОрганизация());
		Запрос.УстановитьПараметр("ДанныеКонтрагентов", 		 ДанныеКонтрагентов);
			
		ДанныеКонтрагентов 	 = Запрос.Выполнить().Выгрузить();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция КонтрагентЯвляетсяИностранным(Контрагент)
	
	Если ТипЗнч(Контрагент) = Тип("СправочникСсылка.Контрагенты")
		И Не Контрагент.Пустая() Тогда
		СтранаРегистрации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Контрагент, "СтранаРегистрации");
	ИначеЕсли ТипЗнч(Контрагент) = Тип("СправочникОбъект.Контрагенты") Тогда
		СтранаРегистрации = Контрагент.СтранаРегистрации;
	Иначе
		СтранаРегистрации = Неопределено;
	КонецЕсли;
	
	ЯвляетсяИностранным = ТипЗнч(СтранаРегистрации) = Тип("СправочникСсылка.СтраныМира")
		И СтранаРегистрации <> Справочники.СтраныМира.Россия;

	Возврат ЯвляетсяИностранным;	
		
КонецФункции

Функция ПричинаОтключенияПроверкиФНСИностраннаяОрганизация()
	
	Возврат НСтр("ru='проверке подлежат только российские контрагенты'")
	
КонецФункции

Функция СимвольноеПредставлениеВалютыУчета()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВалютаУчета.Значение.СимвольноеПредставление КАК СимвольноеПредставление
	|ИЗ
	|	Константа.ВалютаУчета КАК ВалютаУчета";
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат "";
	КонецЕсли;
	
	ВалютаУчета = Результат.Выбрать();
	ВалютаУчета.Следующий();
	Возврат ВалютаУчета.СимвольноеПредставление;
	
КонецФункции

#КонецОбласти
